app/controllers/beers_controller.rb

  def index
    @beers = Beer.all
---
SELECT "beers".* FROM "beers"

  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("brewery_id", "created_at", "name", "style", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 1], ["created_at", "2015-02-01 15:24:46.867999"], ["name", "koffii"], ["style", "Weizen"], ["updated_at", "2015-02-01 15:24:46.867999"]]

    def set_beer
      @beer = Beer.find(params[:id])
---
SELECT  "beers".* FROM "beers"  WHERE "beers"."id" = ? LIMIT 1  [["id", 26]]

def set_breweries_and_styles_for_template
    @breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"