app/controllers/ratings_controller.rb

SELECT "ratings".* FROM "ratings"
---
  def index
    @ratings = Rating.all

SELECT "beers".* FROM "beers"
---
  def new
    @rating = Rating.new
    @beers = Beer.all

INSERT INTO "ratings" ("beer_id", "created_at", "score", "updated_at") VALUES (?, ?, ?, ?)  [["beer_id", 1], ["created_at", "2015-02-01 15:25:29.631041"], ["score", 15], ["updated_at", "2015-02-01 15:25:29.631041"]]
SELECT "beers".* FROM "beers"
---
  def create
    @rating = Rating.new params.require(:rating).permit(:score, :beer_id)

    if current_user.nil?
          redirect_to signin_path, notice:'you should be signed in'
    elsif @rating.save
      current_user.ratings << @rating  ## virheen aiheuttanut rivi
      redirect_to user_path current_user
    else
      @beers = Beer.all